OdDAI.BaseException.functionId
\details
Returns the name of the function in which the exception occurred.
\returns
const char pointer to the name of the function in which the exception occurred.

OdDAI.BaseException.description
\details
Returns the error description text of the exception.
\returns
const char pointer to the error description text.

OdDAI.BaseException.errorId
\details
Returns the error identifier of the exception.
\returns
Error identifier of the exception as daiErrorId type.

OdDAI.BaseException.op_Assign(OdDAI.BaseException!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the BaseException class.
\param exception            [in] Exception to assign.
\returns
Reference to this modified object.

OdDAI.BaseException.Dispose
\details
Destructor for the BaseException class.

OdDAI.BaseException.#ctor(OdDAI.BaseException!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy constructor for the BaseException class.
\param exception        [in] Exception to copy.

OdDAI.BaseException.#ctor(System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Constructor for the BaseException class.
\param minor            [in] Error identifier.
\param errorDescription [in/out] Error description text, can be NULL. If NULL, receives description text of an error code in a human-readable form.
\param functionId       [in] Function in which the exception occurred.